My Emacs Configuration! Enjoy

** Set personal information
   I am a gopher!
   #+BEGIN_SRC emacs-lisp
   (setq user-full-name "Francesco Antonello Ferraro"
        user-mail-address "francescoaferraro@gmail.com "
        calendar-latitude 42.2
        calendar-longitude -71.1
        calendar-location-name "Cambridge, MA")
   #+END_SRC

   #+RESULTS:
   : Cambridge, MA

** PATH

   #+BEGIN_SRC emacs-lisp

(when (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))


   #+END_SRC

   #+RESULTS:
   | bash | cannot set terminal process group (-1) | Inappropriate ioctl for devicebash | no job control in this shell[3;J[H[2J/home/cescoferraro/.nvm/versions/node/v6.10.2/bin | bash | cannot set terminal process group (-1) | Inappropriate ioctl for devicebash | no job control in this shell[3;J[H[2Jbash | cannot set terminal process group (-1) | Inappropriate ioctl for devicebash | no job control in this shell[3;J[H[2Jbash | cannot set terminal process group (-1) | Inappropriate ioctl for devicebash | no job control in this shell[3;J[H[2J/home/cescoferraro/.cargo/bin | /home/cescoferraro/bin | /usr/local/sbin | /usr/local/bin | /usr/sbin | /usr/bin | /sbin | /bin | /usr/games | /usr/local/games |

